/*26.09.2025*/

// №1 Дан текст со словами. Запишите в массив все слова, начинающиеся на букву 'a'.
const text = "After an adventurous afternoon, Alice ate an avocado and drank aromatic tea. Ancient artifacts and antique armor are displayed at the archaeological museum."


// №2 Дан массив с числами. Оставьте в нем только те числа, которые делятся на 5.



// №3 Дан массив с числами. Оставьте в нем только те числа, которые содержат цифру ноль.



// №4 Дан массив со числами. Проверьте, что в нем есть число, содержащее в себе цифру 3.

// №5 Дан некоторый массив, например, вот такой:
// [123, 456, 789]
// Слейте все элементы этого массива в один массив, разбив их посимвольно:
// [1, 2, 3, 4, 5, 6, 7, 8, 9]

// №6 Напишите функцию, которая параметрами будет принимать любое количество чисел, а возвращать их конкатенацию.
// №7 Напишите функцию, которая параметрами будет принимать любое количество строк и возвращать их конкатенацию.
// №8 Дан массив целых чисел. Напишите функцию которая вернет общие делители этих чисел.